In [ ]:
import pandas as pd, numpy as np
from pandas import DataFrame

In [38]:
df = DataFrame({'col1':[1,2,3,4,],
               'col2':[444,555,666,444],
               'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

In [ ]:
len(df['col2'].unique())

In [ ]:
df['col2'].nunique()

In [ ]:
df['col2'].value_counts()

In [ ]:
df[(df['col1']>2) & (df['col2']==444)]

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].apply(times2)

In [ ]:
df['col1'].apply(lambda x: x*2)

In [ ]:
df.drop('col1',axis=1,inplace=True)

In [ ]:
df.columns

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [40]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [53]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
         'D':[1,3,4,5,4,1]}
df = pd.DataFrame(data)

In [57]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  4
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [56]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  4.0  NaN